bbenoist.nix
bbenoist.vagrant
charliermarsh.ruff
ecmel.vscode-html-css
esbenp.prettier-vscode
evondev.indent-rainbow-palettes
formulahendry.auto-rename-tag
formulahendry.code-runner
hediet.vscode-drawio
kameshkotwani.google-search
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.live-server
ms-vscode.remote-explorer
myriad-dreamin.tinymist
oderwat.indent-rainbow
pkief.material-icon-theme
tomoki1207.pdf
usernamehw.errorlens
wmaurer.change-case
yzhang.markdown-all-in-one
zhuangtongfa.material-theme